Revit 2027 API
SpaceTag.SpaceTagType Property
The tag type.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpaceTagType SpaceTagType { get; set; }
Public Property SpaceTagType As SpaceTagType
	Get
	Set
public:
property SpaceTagType^ SpaceTagType {
	SpaceTagType^ get ();
	void set (SpaceTagType^ value);
}
member SpaceTagType : SpaceTagType with get, set
Property Value
SpaceTagType
See Also
Reference
SpaceTag Class
Autodesk.Revit.DB.Mechanical Namespace